Terraform plan in __terraform__
<details>
  <summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.function will be updated in-place
  ~ resource "google_cloudfunctions_function" "function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/slack-publisher"
        name                  = "slack-publisher"
      ~ source_archive_object = "function_content.zip" -> "function_content.zip#4fbd529289d366c584be6729c6d80e09"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.archive must be replaced
-/+ resource "google_storage_bucket_object" "archive" {
      ~ content_type   = "application/zip" -> (known after apply)
      ~ crc32c         = "tDpifw==" -> (known after apply)
      ~ detect_md5hash = "RT6rQOYeW2GY0ubR/o9UPQ==" -> "different hash" # forces replacement
      ~ id             = "********************************************************************************" -> (known after apply)
      ~ md5hash        = "RT6rQOYeW2GY0ubR/o9UPQ==" -> (known after apply)
      ~ name           = "function_content.zip#453eab40e61e5b6198d2e6d1fe8f543d" -> "function_content.zip#4fbd529289d366c584be6729c6d80e09" # forces replacement
      ~ output_name    = "function_content.zip#453eab40e61e5b6198d2e6d1fe8f543d" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/lilaobot-functions-storage/o/function_content.zip%23453eab40e61e5b6198d2e6d1fe8f543d" -> (known after apply)
      ~ storage_class  = "STANDARD" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

Plan generated in [Create terraform plan #8](https://github.com/Zenika/lilaobot/actions/runs/983029706)